app/controllers/histories_controller.rb

SELECT "histories".* FROM "histories"
---
  def index
    @histories = History.all

INSERT INTO "histories" ("owner", "request", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["owner", "test_owner"], ["request", "test_request"], ["created_at", 2016-12-22 08:12:51 UTC], ["updated_at", 2016-12-22 08:12:51 UTC]]
---
  def create
    @history = History.new(history_params)

    respond_to do |format|
      if @history.save

DELETE FROM "histories" WHERE "histories"."id" = $1  [["id", 1]]
---
  def destroy
    @history.destroy

SELECT  "histories".* FROM "histories" WHERE "histories"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_history
      @history = History.find(params[:id])