app/controllers/requests_controller.rb

  def index
    redirect_back(fallback_location: root_path) if current_user.nil? || current_user.email != 'admin'
    @requests = Request.all
---
SELECT "requests".* FROM "requests"

  def update
    respond_to do |format|
      if @request.update(request_params)
---
UPDATE "requests" SET "request" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["request", "hehehehehehehehehhehehehehehhe"], ["updated_at", 2016-12-29 22:17:11 UTC], ["id", 9]]

  def destroy
    @request.destroy if !@request.nil?
---
DELETE FROM "requests" WHERE "requests"."id" = $1  [["id", 1]]

    def set_request
      @request = Request.find(params[:id])
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]