app/controllers/search_controller.rb

SELECT "requests".* FROM "requests" ORDER BY "requests"."count" DESC
SELECT COUNT(*) FROM "requests"
---
  def input
    @top_hour = Request.order(count: :desc).all.select{ |x| x.updated_at.localtime > Time.zone.now - 1.hour }

SELECT  "requests".* FROM "requests" WHERE "requests"."request" = $1 LIMIT $2  [["request", "go to"], ["LIMIT", 1]]
INSERT INTO "histories" ("owner", "request", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
UPDATE "requests" SET "count" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["count", 2], ["updated_at", 2016-12-23 21:24:08 UTC], ["id", 1]]
INSERT INTO "requests" ("request", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["request", "kek"], ["count", 1], ["created_at", 2016-12-23 21:24:01 UTC], ["updated_at", 2016-12-23 21:24:01 UTC]]
---
  def view
    @new = params[:new]
    @start = params[:start]
  	@req = (buf = params[:str]).nil? ? '' : buf
    get_res = get_result_hash(@req, @start)
    db_req = Request.all.find_by(request: @req)

    if !get_res.nil?
      @result_array = result_processing(get_res["items"])
    else
      @result_array = nil
    end

    if @new == 'true'
      if !current_user.nil?
        new_req = History.new do |req|
          req.owner = current_user.email
          req.request = @req
        end
        new_req.save
      end

      if !db_req.nil?
        db_req.update :count => db_req.count + 1
      else
        db_req = Request.new do |req|
          req.request = @req
          req.count = 1
        end
      end
      db_req.save