app/controllers/top_controller.rb

SELECT "requests".* FROM "requests" ORDER BY "requests"."count" DESC
---
  def all
    @start = params[:start].to_i
    top_all_buf = Request.order(count: :desc).all

SELECT "requests".* FROM "requests" ORDER BY "requests"."count" DESC
---
  def hour
    @start = params[:start].to_i
    top_hour_buf = Request.order(count: :desc).all.select{ |x| x.updated_at.localtime > Time.zone.now - 1.hour }

SELECT "requests".* FROM "requests" ORDER BY "requests"."count" DESC
---
  def day
    @start = params[:start].to_i
    top_day_buf = Request.order(count: :desc).all.select{ |x| x.updated_at.localtime > Time.zone.now - 1.day }

SELECT "requests".* FROM "requests" ORDER BY "requests"."count" DESC
---
  def week
    @start = params[:start].to_i
    top_week_buf = Request.order(count: :desc).all.select{ |x| x.updated_at.localtime > Time.zone.now - 7.days }

SELECT "requests".* FROM "requests" ORDER BY "requests"."count" DESC
---
  def month
    @start = params[:start].to_i
    top_month_buf = Request.order(count: :desc).all.select{ |x| x.updated_at.localtime > Time.zone.now - 1.month }