app/controllers/users_controller.rb

SELECT  "histories".* FROM "histories" WHERE "histories"."owner" = $1 LIMIT $2  [["owner", "123@123.123"], ["LIMIT", 1]]
---
  def profile
  	@start = params[:start].to_i
  	history_buf = History.all.select{ |x| x.owner == current_user.email }.reverse